In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('data.csv')
df.head()

      Name  Age  Income  Gender
0    Alice   25   50000  Female
1      Bob   30   55000    Male
2  Charlie   35   60000    Male
3    David   28   52000  Female
4      Eva   40   65000  Female

In [3]:
df.describe()

             Age        Income
count   8.000000      8.000000
mean   39.125000  63375.000000
std    12.028983  11005.680352
min    25.000000  50000.000000
25%    29.500000  54250.000000
50%    37.500000  62500.000000
75%    46.250000  71250.000000
max    60.000000  80000.000000

In [4]:
df.dtypes

Name      object
Age        int64
Income     int64
Gender    object
dtype: object

In [5]:
income = df.groupby('Gender')['Income'].describe()
print(income)

        count     mean           std      min      25%      50%      75%  \
Gender
Female    4.0  60500.0  11733.143938  50000.0  51500.0  58500.0  67500.0
Male      4.0  66250.0  11086.778913  55000.0  58750.0  65000.0  72500.0

            max
Gender
Female  75000.0
Male    80000.0